echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l151k4.h
#define RTC_ALRMAR2_ALMNU        RTC_ALRMAR2_bit.ALMNU
#define RTC_ALRMAR2_ALMNT        RTC_ALRMAR2_bit.ALMNT
#define RTC_ALRMAR2_MSK2         RTC_ALRMAR2_bit.MSK2

#define RTC_ALRMAR3_ALHU         RTC_ALRMAR3_bit.ALHU
#define RTC_ALRMAR3_ALHT         RTC_ALRMAR3_bit.ALHT
#define RTC_ALRMAR3_PM           RTC_ALRMAR3_bit.PM
#define RTC_ALRMAR3_MSK3         RTC_ALRMAR3_bit.MSK3

#define RTC_ALRMAR4_ALDU         RTC_ALRMAR4_bit.ALDU
#define RTC_ALRMAR4_ALDT         RTC_ALRMAR4_bit.ALDT
#define RTC_ALRMAR4_WDSEL        RTC_ALRMAR4_bit.WDSEL
#define RTC_ALRMAR4_MSK4         RTC_ALRMAR4_bit.MSK4

#define RTC_SSRL_ALSS0           RTC_SSRL_bit.ALSS0
#define RTC_SSRL_ALSS1           RTC_SSRL_bit.ALSS1
#define RTC_SSRL_ALSS2           RTC_SSRL_bit.ALSS2
#define RTC_SSRL_ALSS3           RTC_SSRL_bit.ALSS3
#define RTC_SSRL_ALSS4           RTC_SSRL_bit.ALSS4
#define RTC_SSRL_ALSS5           RTC_SSRL_bit.ALSS5
#define RTC_SSRL_ALSS6           RTC_SSRL_bit.ALSS6
#define RTC_SSRL_ALSS7           RTC_SSRL_bit.ALSS7

#define RTC_SSRH_ALSS8           RTC_SSRH_bit.ALSS8
#define RTC_SSRH_ALSS9           RTC_SSRH_bit.ALSS9
#define RTC_SSRH_ALSS10          RTC_SSRH_bit.ALSS10
#define RTC_SSRH_ALSS11          RTC_SSRH_bit.ALSS11
#define RTC_SSRH_ALSS12          RTC_SSRH_bit.ALSS12
#define RTC_SSRH_ALSS13          RTC_SSRH_bit.ALSS13
#define RTC_SSRH_ALSS14          RTC_SSRH_bit.ALSS14
#define RTC_SSRH_ALSS15          RTC_SSRH_bit.ALSS15

#define RTC_SHIFTRH_SUBFS8       RTC_SHIFTRH_bit.SUBFS8
#define RTC_SHIFTRH_SUBFS9       RTC_SHIFTRH_bit.SUBFS9
#define RTC_SHIFTRH_SUBFS10      RTC_SHIFTRH_bit.SUBFS10
#define RTC_SHIFTRH_SUBFS11      RTC_SHIFTRH_bit.SUBFS11
#define RTC_SHIFTRH_SUBFS12      RTC_SHIFTRH_bit.SUBFS12
#define RTC_SHIFTRH_SUBFS13      RTC_SHIFTRH_bit.SUBFS13
#define RTC_SHIFTRH_SUBFS14      RTC_SHIFTRH_bit.SUBFS14
#define RTC_SHIFTRH_ADD1S        RTC_SHIFTRH_bit.ADD1S

#define RTC_SHIFTRL_SUBFS0       RTC_SHIFTRL_bit.SUBFS0
#define RTC_SHIFTRL_SUBFS1       RTC_SHIFTRL_bit.SUBFS1
#define RTC_SHIFTRL_SUBFS2       RTC_SHIFTRL_bit.SUBFS2
#define RTC_SHIFTRL_SUBFS3       RTC_SHIFTRL_bit.SUBFS3
#define RTC_SHIFTRL_SUBFS4       RTC_SHIFTRL_bit.SUBFS4
#define RTC_SHIFTRL_SUBFS5       RTC_SHIFTRL_bit.SUBFS5
#define RTC_SHIFTRL_SUBFS6       RTC_SHIFTRL_bit.SUBFS6
#define RTC_SHIFTRL_SUBFS7       RTC_SHIFTRL_bit.SUBFS7

#define RTC_ALRMASSRH_ALSS8      RTC_ALRMASSRH_bit.ALSS8
#define RTC_ALRMASSRH_ALSS9      RTC_ALRMASSRH_bit.ALSS9
#define RTC_ALRMASSRH_ALSS10     RTC_ALRMASSRH_bit.ALSS10
#define RTC_ALRMASSRH_ALSS11     RTC_ALRMASSRH_bit.ALSS11
#define RTC_ALRMASSRH_ALSS12     RTC_ALRMASSRH_bit.ALSS12
#define RTC_ALRMASSRH_ALSS13     RTC_ALRMASSRH_bit.ALSS13
#define RTC_ALRMASSRH_ALSS14     RTC_ALRMASSRH_bit.ALSS14

#define RTC_ALRMASSRL_ALSS0      RTC_ALRMASSRL_bit.ALSS0
#define RTC_ALRMASSRL_ALSS1      RTC_ALRMASSRL_bit.ALSS1
#define RTC_ALRMASSRL_ALSS2      RTC_ALRMASSRL_bit.ALSS2
#define RTC_ALRMASSRL_ALSS3      RTC_ALRMASSRL_bit.ALSS3
#define RTC_ALRMASSRL_ALSS4      RTC_ALRMASSRL_bit.ALSS4
#define RTC_ALRMASSRL_ALSS5      RTC_ALRMASSRL_bit.ALSS5
#define RTC_ALRMASSRL_ALSS6      RTC_ALRMASSRL_bit.ALSS6
#define RTC_ALRMASSRL_ALSS7      RTC_ALRMASSRL_bit.ALSS7

#define RTC_ALRMASSMSKR_MASKSS   RTC_ALRMASSMSKR_bit.MASKSS

#define RTC_CALRH_CALM8          RTC_CALRH_bit.CALM8
#define RTC_CALRH_CALW16         RTC_CALRH_bit.CALW16
#define RTC_CALRH_CALW8          RTC_CALRH_bit.CALW8
#define RTC_CALRH_CALP           RTC_CALRH_bit.CALP

#define RTC_CALRL_CALM0          RTC_CALRL_bit.CALM0
#define RTC_CALRL_CALM1          RTC_CALRL_bit.CALM1
#define RTC_CALRL_CALM2          RTC_CALRL_bit.CALM2
#define RTC_CALRL_CALM3          RTC_CALRL_bit.CALM3
#define RTC_CALRL_CALM4          RTC_CALRL_bit.CALM4
#define RTC_CALRL_CALM5          RTC_CALRL_bit.CALM5
#define RTC_CALRL_CALM6          RTC_CALRL_bit.CALM6
#define RTC_CALRL_CALM7          RTC_CALRL_bit.CALM7

#define RTC_TCR1_TAMPIE          RTC_TCR1_bit.TAMPIE
#define RTC_TCR1_TAMP1E          RTC_TCR1_bit.TAMP1E
#define RTC_TCR1_TAMP1TRG        RTC_TCR1_bit.TAMP1TRG
#define RTC_TCR1_TAMP2E          RTC_TCR1_bit.TAMP2E
#define RTC_TCR1_TAMP2TRG        RTC_TCR1_bit.TAMP2TRG
#define RTC_TCR1_TAMP3E          RTC_TCR1_bit.TAMP3E
#define RTC_TCR1_TAMP3TRG        RTC_TCR1_bit.TAMP3TRG

#define RTC_TCR2_TAMPFREQ        RTC_TCR2_bit.TAMPFREQ
#define RTC_TCR2_TAMPFLT         RTC_TCR2_bit.TAMPFLT
#define RTC_TCR2_TAMPPRCH        RTC_TCR2_bit.TAMPPRCH
#define RTC_TCR2_TAMPPUDIS       RTC_TCR2_bit.TAMPPUDIS

#endif

/*-------------------------------------------------------------------------
 *      RTC bit masks
 *-----------------------------------------------------------------------*/
#define MASK_RTC_TR1_SU          0x0F
#define MASK_RTC_TR1_ST          0xF0

#define MASK_RTC_TR2_MNU         0x0F
#define MASK_RTC_TR2_MNT         0xF0

#define MASK_RTC_TR3_HU          0x0F
#define MASK_RTC_TR3_HT          0x30
#define MASK_RTC_TR3_PM          0x40

#define MASK_RTC_DR1_DU          0x0F
#define MASK_RTC_DR1_DT          0x30

#define MASK_RTC_DR2_MU          0x0F
#define MASK_RTC_DR2_MT          0x10
#define MASK_RTC_DR2_WDU         0xE0

#define MASK_RTC_DR3_YU          0x0F
#define MASK_RTC_DR3_YT          0xF0

#define MASK_RTC_CR1_WUCKSEL     0x0F
#define MASK_RTC_CR1_RATIO       0x20
#define MASK_RTC_CR1_FMT         0x40

#define MASK_RTC_CR2_ALRAE       0x01
#define MASK_RTC_CR2_WUTE        0x04
#define MASK_RTC_CR2_ALRAIE      0x10
#define MASK_RTC_CR2_WUTIE       0x40

#define MASK_RTC_CR3_ADD1H       0x01
#define MASK_RTC_CR3_SUB1H       0x02
#define MASK_RTC_CR3_BCK         0x04
#define MASK_RTC_CR3_POL         0x10
#define MASK_RTC_CR3_OSEL        0x60
#define MASK_RTC_CR3_COE         0x80

#define MASK_RTC_ISR1_ALRAWF     0x01
#define MASK_RTC_ISR1_RECALPF    0x02
#define MASK_RTC_ISR1_WUTWF      0x04
#define MASK_RTC_ISR1_SHPF       0x08
#define MASK_RTC_ISR1_INITS      0x10
#define MASK_RTC_ISR1_RSF        0x20
#define MASK_RTC_ISR1_INITF      0x40
#define MASK_RTC_ISR1_INIT       0x80

#define MASK_RTC_ISR2_ALRAF      0x01
#define MASK_RTC_ISR2_WUTF       0x04
#define MASK_RTC_ISR2_TAMP1F     0x20
#define MASK_RTC_ISR2_TAMP2F     0x40
#define MASK_RTC_ISR2_TAMP3F     0x80

#define MASK_RTC_SPRERH_PREDIV_S8 0x01
#define MASK_RTC_SPRERH_PREDIV_S9 0x02
#define MASK_RTC_SPRERH_PREDIV_S10 0x04
#define MASK_RTC_SPRERH_PREDIV_S11 0x08
#define MASK_RTC_SPRERH_PREDIV_S12 0x10

