echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l151k4.h
/* TIM2 counter low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CNT0        : 1;
  unsigned char CNT1        : 1;
  unsigned char CNT2        : 1;
  unsigned char CNT3        : 1;
  unsigned char CNT4        : 1;
  unsigned char CNT5        : 1;
  unsigned char CNT6        : 1;
  unsigned char CNT7        : 1;
} __BITS_TIM2_CNTRL;
#endif
__IO_REG8_BIT(TIM2_CNTRL,  0x525D, __READ_WRITE, __BITS_TIM2_CNTRL);

/* TIM2 prescaler register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char PSC         : 3;
} __BITS_TIM2_PSCR;
#endif
__IO_REG8_BIT(TIM2_PSCR,   0x525E, __READ_WRITE, __BITS_TIM2_PSCR);

/* TIM2 auto-reload register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR8        : 1;
  unsigned char ARR9        : 1;
  unsigned char ARR10       : 1;
  unsigned char ARR11       : 1;
  unsigned char ARR12       : 1;
  unsigned char ARR13       : 1;
  unsigned char ARR14       : 1;
  unsigned char ARR15       : 1;
} __BITS_TIM2_ARRH;
#endif
__IO_REG8_BIT(TIM2_ARRH,   0x525F, __READ_WRITE, __BITS_TIM2_ARRH);

/* TIM2 auto-reload register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char ARR0        : 1;
  unsigned char ARR1        : 1;
  unsigned char ARR2        : 1;
  unsigned char ARR3        : 1;
  unsigned char ARR4        : 1;
  unsigned char ARR5        : 1;
  unsigned char ARR6        : 1;
  unsigned char ARR7        : 1;
} __BITS_TIM2_ARRL;
#endif
__IO_REG8_BIT(TIM2_ARRL,   0x5260, __READ_WRITE, __BITS_TIM2_ARRL);

/* TIM2 capture/compare register 1 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR18       : 1;
  unsigned char CCR19       : 1;
  unsigned char CCR110      : 1;
  unsigned char CCR111      : 1;
  unsigned char CCR112      : 1;
  unsigned char CCR113      : 1;
  unsigned char CCR114      : 1;
  unsigned char CCR115      : 1;
} __BITS_TIM2_CCR1H;
#endif
__IO_REG8_BIT(TIM2_CCR1H,  0x5261, __READ_WRITE, __BITS_TIM2_CCR1H);

/* TIM2 capture/compare register 1 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM2_CCR1L;
#endif
__IO_REG8_BIT(TIM2_CCR1L,  0x5262, __READ_WRITE, __BITS_TIM2_CCR1L);

/* TIM2 capture/compare register 2 high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR28       : 1;
  unsigned char CCR29       : 1;
  unsigned char CCR210      : 1;
  unsigned char CCR211      : 1;
  unsigned char CCR212      : 1;
  unsigned char CCR213      : 1;
  unsigned char CCR214      : 1;
  unsigned char CCR215      : 1;
} __BITS_TIM2_CCR2H;
#endif
__IO_REG8_BIT(TIM2_CCR2H,  0x5263, __READ_WRITE, __BITS_TIM2_CCR2H);

/* TIM2 capture/compare register 2 low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CCR10       : 1;
  unsigned char CCR11       : 1;
  unsigned char CCR12       : 1;
  unsigned char CCR13       : 1;
  unsigned char CCR14       : 1;
  unsigned char CCR15       : 1;
  unsigned char CCR16       : 1;
  unsigned char CCR17       : 1;
} __BITS_TIM2_CCR2L;
#endif
__IO_REG8_BIT(TIM2_CCR2L,  0x5264, __READ_WRITE, __BITS_TIM2_CCR2L);

/* TIM2 break register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LOCK        : 2;
  unsigned char OSSI        : 1;
  unsigned char             : 1;
  unsigned char BKE         : 1;
  unsigned char BKP         : 1;
  unsigned char AOE         : 1;
  unsigned char MOE         : 1;
} __BITS_TIM2_BKR;
#endif
__IO_REG8_BIT(TIM2_BKR,    0x5265, __READ_WRITE, __BITS_TIM2_BKR);

/* TIM2 output idle state register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char OIS1        : 1;
  unsigned char             : 1;
  unsigned char OIS2        : 1;
} __BITS_TIM2_OISR;
#endif
__IO_REG8_BIT(TIM2_OISR,   0x5266, __READ_WRITE, __BITS_TIM2_OISR);


/*-------------------------------------------------------------------------
 *      TIM2 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define TIM2_CR1_CEN             TIM2_CR1_bit.CEN
#define TIM2_CR1_UDIS            TIM2_CR1_bit.UDIS
#define TIM2_CR1_URS             TIM2_CR1_bit.URS
#define TIM2_CR1_OPM             TIM2_CR1_bit.OPM
#define TIM2_CR1_DIR             TIM2_CR1_bit.DIR
#define TIM2_CR1_CMS             TIM2_CR1_bit.CMS
#define TIM2_CR1_ARPE            TIM2_CR1_bit.ARPE

#define TIM2_CR2_CCDS            TIM2_CR2_bit.CCDS
#define TIM2_CR2_MMS             TIM2_CR2_bit.MMS
#define TIM2_CR2_TI1S            TIM2_CR2_bit.TI1S

#define TIM2_SMCR_SMS            TIM2_SMCR_bit.SMS
#define TIM2_SMCR_TS             TIM2_SMCR_bit.TS
#define TIM2_SMCR_MSM            TIM2_SMCR_bit.MSM

#define TIM2_ETR_ETF             TIM2_ETR_bit.ETF
#define TIM2_ETR_ETPS            TIM2_ETR_bit.ETPS
#define TIM2_ETR_ECE             TIM2_ETR_bit.ECE
#define TIM2_ETR_ETP             TIM2_ETR_bit.ETP

#define TIM2_DER_UDE             TIM2_DER_bit.UDE
#define TIM2_DER_CC1DE           TIM2_DER_bit.CC1DE
#define TIM2_DER_CC2DE           TIM2_DER_bit.CC2DE

#define TIM2_IER_UIE             TIM2_IER_bit.UIE
#define TIM2_IER_CC1IE           TIM2_IER_bit.CC1IE
#define TIM2_IER_CC2IE           TIM2_IER_bit.CC2IE
#define TIM2_IER_TIE             TIM2_IER_bit.TIE
#define TIM2_IER_BIE             TIM2_IER_bit.BIE

#define TIM2_SR1_UIF             TIM2_SR1_bit.UIF
#define TIM2_SR1_CC1IF           TIM2_SR1_bit.CC1IF
#define TIM2_SR1_CC2IF           TIM2_SR1_bit.CC2IF
#define TIM2_SR1_TIF             TIM2_SR1_bit.TIF
#define TIM2_SR1_BIF             TIM2_SR1_bit.BIF

#define TIM2_SR2_CC1OF           TIM2_SR2_bit.CC1OF
#define TIM2_SR2_CC2OF           TIM2_SR2_bit.CC2OF

#define TIM2_EGR_UG              TIM2_EGR_bit.UG
#define TIM2_EGR_CC1G            TIM2_EGR_bit.CC1G
#define TIM2_EGR_CC2G            TIM2_EGR_bit.CC2G
#define TIM2_EGR_TG              TIM2_EGR_bit.TG
#define TIM2_EGR_BG              TIM2_EGR_bit.BG

#define TIM2_CCMR1_CC1S          TIM2_CCMR1_bit.CC1S
#define TIM2_CCMR1_OC1FE         TIM2_CCMR1_bit.OC1FE
#define TIM2_CCMR1_OC1PE         TIM2_CCMR1_bit.OC1PE
#define TIM2_CCMR1_OC1M          TIM2_CCMR1_bit.OC1M

#define TIM2_CCMR2_CC2S          TIM2_CCMR2_bit.CC2S
#define TIM2_CCMR2_OC2FE         TIM2_CCMR2_bit.OC2FE
#define TIM2_CCMR2_OC2PE         TIM2_CCMR2_bit.OC2PE
#define TIM2_CCMR2_OC2M          TIM2_CCMR2_bit.OC2M

#define TIM2_CCER1_CC1E          TIM2_CCER1_bit.CC1E
#define TIM2_CCER1_CC1P          TIM2_CCER1_bit.CC1P
#define TIM2_CCER1_CC2E          TIM2_CCER1_bit.CC2E
#define TIM2_CCER1_CC2P          TIM2_CCER1_bit.CC2P

#define TIM2_CNTRH_CNT8          TIM2_CNTRH_bit.CNT8
#define TIM2_CNTRH_CNT9          TIM2_CNTRH_bit.CNT9
#define TIM2_CNTRH_CNT10         TIM2_CNTRH_bit.CNT10
#define TIM2_CNTRH_CNT11         TIM2_CNTRH_bit.CNT11
#define TIM2_CNTRH_CNT12         TIM2_CNTRH_bit.CNT12
#define TIM2_CNTRH_CNT13         TIM2_CNTRH_bit.CNT13
#define TIM2_CNTRH_CNT14         TIM2_CNTRH_bit.CNT14
#define TIM2_CNTRH_CNT15         TIM2_CNTRH_bit.CNT15

#define TIM2_CNTRL_CNT0          TIM2_CNTRL_bit.CNT0
#define TIM2_CNTRL_CNT1          TIM2_CNTRL_bit.CNT1
#define TIM2_CNTRL_CNT2          TIM2_CNTRL_bit.CNT2
#define TIM2_CNTRL_CNT3          TIM2_CNTRL_bit.CNT3
#define TIM2_CNTRL_CNT4          TIM2_CNTRL_bit.CNT4
#define TIM2_CNTRL_CNT5          TIM2_CNTRL_bit.CNT5
#define TIM2_CNTRL_CNT6          TIM2_CNTRL_bit.CNT6
#define TIM2_CNTRL_CNT7          TIM2_CNTRL_bit.CNT7

#define TIM2_PSCR_PSC            TIM2_PSCR_bit.PSC

#define TIM2_ARRH_ARR8           TIM2_ARRH_bit.ARR8
#define TIM2_ARRH_ARR9           TIM2_ARRH_bit.ARR9
#define TIM2_ARRH_ARR10          TIM2_ARRH_bit.ARR10
#define TIM2_ARRH_ARR11          TIM2_ARRH_bit.ARR11
#define TIM2_ARRH_ARR12          TIM2_ARRH_bit.ARR12
#define TIM2_ARRH_ARR13          TIM2_ARRH_bit.ARR13
#define TIM2_ARRH_ARR14          TIM2_ARRH_bit.ARR14
#define TIM2_ARRH_ARR15          TIM2_ARRH_bit.ARR15

#define TIM2_ARRL_ARR0           TIM2_ARRL_bit.ARR0
#define TIM2_ARRL_ARR1           TIM2_ARRL_bit.ARR1
#define TIM2_ARRL_ARR2           TIM2_ARRL_bit.ARR2
#define TIM2_ARRL_ARR3           TIM2_ARRL_bit.ARR3
#define TIM2_ARRL_ARR4           TIM2_ARRL_bit.ARR4
#define TIM2_ARRL_ARR5           TIM2_ARRL_bit.ARR5
#define TIM2_ARRL_ARR6           TIM2_ARRL_bit.ARR6
#define TIM2_ARRL_ARR7           TIM2_ARRL_bit.ARR7

#define TIM2_CCR1H_CCR18         TIM2_CCR1H_bit.CCR18
#define TIM2_CCR1H_CCR19         TIM2_CCR1H_bit.CCR19
#define TIM2_CCR1H_CCR110        TIM2_CCR1H_bit.CCR110
#define TIM2_CCR1H_CCR111        TIM2_CCR1H_bit.CCR111
#define TIM2_CCR1H_CCR112        TIM2_CCR1H_bit.CCR112
#define TIM2_CCR1H_CCR113        TIM2_CCR1H_bit.CCR113
#define TIM2_CCR1H_CCR114        TIM2_CCR1H_bit.CCR114
#define TIM2_CCR1H_CCR115        TIM2_CCR1H_bit.CCR115

#define TIM2_CCR1L_CCR10         TIM2_CCR1L_bit.CCR10
#define TIM2_CCR1L_CCR11         TIM2_CCR1L_bit.CCR11
#define TIM2_CCR1L_CCR12         TIM2_CCR1L_bit.CCR12
#define TIM2_CCR1L_CCR13         TIM2_CCR1L_bit.CCR13
#define TIM2_CCR1L_CCR14         TIM2_CCR1L_bit.CCR14
#define TIM2_CCR1L_CCR15         TIM2_CCR1L_bit.CCR15
#define TIM2_CCR1L_CCR16         TIM2_CCR1L_bit.CCR16
#define TIM2_CCR1L_CCR17         TIM2_CCR1L_bit.CCR17

#define TIM2_CCR2H_CCR28         TIM2_CCR2H_bit.CCR28
#define TIM2_CCR2H_CCR29         TIM2_CCR2H_bit.CCR29
#define TIM2_CCR2H_CCR210        TIM2_CCR2H_bit.CCR210
#define TIM2_CCR2H_CCR211        TIM2_CCR2H_bit.CCR211
#define TIM2_CCR2H_CCR212        TIM2_CCR2H_bit.CCR212
#define TIM2_CCR2H_CCR213        TIM2_CCR2H_bit.CCR213
#define TIM2_CCR2H_CCR214        TIM2_CCR2H_bit.CCR214
#define TIM2_CCR2H_CCR215        TIM2_CCR2H_bit.CCR215

#define TIM2_CCR2L_CCR10         TIM2_CCR2L_bit.CCR10
#define TIM2_CCR2L_CCR11         TIM2_CCR2L_bit.CCR11
#define TIM2_CCR2L_CCR12         TIM2_CCR2L_bit.CCR12
#define TIM2_CCR2L_CCR13         TIM2_CCR2L_bit.CCR13
#define TIM2_CCR2L_CCR14         TIM2_CCR2L_bit.CCR14
#define TIM2_CCR2L_CCR15         TIM2_CCR2L_bit.CCR15
#define TIM2_CCR2L_CCR16         TIM2_CCR2L_bit.CCR16
#define TIM2_CCR2L_CCR17         TIM2_CCR2L_bit.CCR17

#define TIM2_BKR_LOCK            TIM2_BKR_bit.LOCK
#define TIM2_BKR_OSSI            TIM2_BKR_bit.OSSI
#define TIM2_BKR_BKE             TIM2_BKR_bit.BKE
#define TIM2_BKR_BKP             TIM2_BKR_bit.BKP
#define TIM2_BKR_AOE             TIM2_BKR_bit.AOE
#define TIM2_BKR_MOE             TIM2_BKR_bit.MOE

#define TIM2_OISR_OIS1           TIM2_OISR_bit.OIS1
#define TIM2_OISR_OIS2           TIM2_OISR_bit.OIS2

#endif

/*-------------------------------------------------------------------------
 *      TIM2 bit masks
 *-----------------------------------------------------------------------*/
#define MASK_TIM2_CR1_CEN        0x01
#define MASK_TIM2_CR1_UDIS       0x02
#define MASK_TIM2_CR1_URS        0x04
#define MASK_TIM2_CR1_OPM        0x08
#define MASK_TIM2_CR1_DIR        0x10
#define MASK_TIM2_CR1_CMS        0x60
#define MASK_TIM2_CR1_ARPE       0x80

