echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l151k4.h
#define TIM1_CCER2_CC3E          TIM1_CCER2_bit.CC3E
#define TIM1_CCER2_CC3P          TIM1_CCER2_bit.CC3P
#define TIM1_CCER2_CC3NE         TIM1_CCER2_bit.CC3NE
#define TIM1_CCER2_CC3NP         TIM1_CCER2_bit.CC3NP
#define TIM1_CCER2_CC4E          TIM1_CCER2_bit.CC4E
#define TIM1_CCER2_CC4P          TIM1_CCER2_bit.CC4P

#define TIM1_CNTRH_CNT8          TIM1_CNTRH_bit.CNT8
#define TIM1_CNTRH_CNT9          TIM1_CNTRH_bit.CNT9
#define TIM1_CNTRH_CNT10         TIM1_CNTRH_bit.CNT10
#define TIM1_CNTRH_CNT11         TIM1_CNTRH_bit.CNT11
#define TIM1_CNTRH_CNT12         TIM1_CNTRH_bit.CNT12
#define TIM1_CNTRH_CNT13         TIM1_CNTRH_bit.CNT13
#define TIM1_CNTRH_CNT14         TIM1_CNTRH_bit.CNT14
#define TIM1_CNTRH_CNT15         TIM1_CNTRH_bit.CNT15

#define TIM1_CNTRL_CNT0          TIM1_CNTRL_bit.CNT0
#define TIM1_CNTRL_CNT1          TIM1_CNTRL_bit.CNT1
#define TIM1_CNTRL_CNT2          TIM1_CNTRL_bit.CNT2
#define TIM1_CNTRL_CNT3          TIM1_CNTRL_bit.CNT3
#define TIM1_CNTRL_CNT4          TIM1_CNTRL_bit.CNT4
#define TIM1_CNTRL_CNT5          TIM1_CNTRL_bit.CNT5
#define TIM1_CNTRL_CNT6          TIM1_CNTRL_bit.CNT6
#define TIM1_CNTRL_CNT7          TIM1_CNTRL_bit.CNT7

#define TIM1_PSCRH_PSC8          TIM1_PSCRH_bit.PSC8
#define TIM1_PSCRH_PSC9          TIM1_PSCRH_bit.PSC9
#define TIM1_PSCRH_PSC10         TIM1_PSCRH_bit.PSC10
#define TIM1_PSCRH_PSC11         TIM1_PSCRH_bit.PSC11
#define TIM1_PSCRH_PSC12         TIM1_PSCRH_bit.PSC12
#define TIM1_PSCRH_PSC13         TIM1_PSCRH_bit.PSC13
#define TIM1_PSCRH_PSC14         TIM1_PSCRH_bit.PSC14
#define TIM1_PSCRH_PSC15         TIM1_PSCRH_bit.PSC15

#define TIM1_PSCRL_PSC0          TIM1_PSCRL_bit.PSC0
#define TIM1_PSCRL_PSC1          TIM1_PSCRL_bit.PSC1
#define TIM1_PSCRL_PSC2          TIM1_PSCRL_bit.PSC2
#define TIM1_PSCRL_PSC3          TIM1_PSCRL_bit.PSC3
#define TIM1_PSCRL_PSC4          TIM1_PSCRL_bit.PSC4
#define TIM1_PSCRL_PSC5          TIM1_PSCRL_bit.PSC5
#define TIM1_PSCRL_PSC6          TIM1_PSCRL_bit.PSC6
#define TIM1_PSCRL_PSC7          TIM1_PSCRL_bit.PSC7

#define TIM1_ARRH_ARR8           TIM1_ARRH_bit.ARR8
#define TIM1_ARRH_ARR9           TIM1_ARRH_bit.ARR9
#define TIM1_ARRH_ARR10          TIM1_ARRH_bit.ARR10
#define TIM1_ARRH_ARR11          TIM1_ARRH_bit.ARR11
#define TIM1_ARRH_ARR12          TIM1_ARRH_bit.ARR12
#define TIM1_ARRH_ARR13          TIM1_ARRH_bit.ARR13
#define TIM1_ARRH_ARR14          TIM1_ARRH_bit.ARR14
#define TIM1_ARRH_ARR15          TIM1_ARRH_bit.ARR15

#define TIM1_ARRL_ARR0           TIM1_ARRL_bit.ARR0
#define TIM1_ARRL_ARR1           TIM1_ARRL_bit.ARR1
#define TIM1_ARRL_ARR2           TIM1_ARRL_bit.ARR2
#define TIM1_ARRL_ARR3           TIM1_ARRL_bit.ARR3
#define TIM1_ARRL_ARR4           TIM1_ARRL_bit.ARR4
#define TIM1_ARRL_ARR5           TIM1_ARRL_bit.ARR5
#define TIM1_ARRL_ARR6           TIM1_ARRL_bit.ARR6
#define TIM1_ARRL_ARR7           TIM1_ARRL_bit.ARR7

#define TIM1_CCR1H_CCR18         TIM1_CCR1H_bit.CCR18
#define TIM1_CCR1H_CCR19         TIM1_CCR1H_bit.CCR19
#define TIM1_CCR1H_CCR110        TIM1_CCR1H_bit.CCR110
#define TIM1_CCR1H_CCR111        TIM1_CCR1H_bit.CCR111
#define TIM1_CCR1H_CCR112        TIM1_CCR1H_bit.CCR112
#define TIM1_CCR1H_CCR113        TIM1_CCR1H_bit.CCR113
#define TIM1_CCR1H_CCR114        TIM1_CCR1H_bit.CCR114
#define TIM1_CCR1H_CCR115        TIM1_CCR1H_bit.CCR115

#define TIM1_CCR1L_CCR10         TIM1_CCR1L_bit.CCR10
#define TIM1_CCR1L_CCR11         TIM1_CCR1L_bit.CCR11
#define TIM1_CCR1L_CCR12         TIM1_CCR1L_bit.CCR12
#define TIM1_CCR1L_CCR13         TIM1_CCR1L_bit.CCR13
#define TIM1_CCR1L_CCR14         TIM1_CCR1L_bit.CCR14
#define TIM1_CCR1L_CCR15         TIM1_CCR1L_bit.CCR15
#define TIM1_CCR1L_CCR16         TIM1_CCR1L_bit.CCR16
#define TIM1_CCR1L_CCR17         TIM1_CCR1L_bit.CCR17

#define TIM1_CCR2H_CCR28         TIM1_CCR2H_bit.CCR28
#define TIM1_CCR2H_CCR29         TIM1_CCR2H_bit.CCR29
#define TIM1_CCR2H_CCR210        TIM1_CCR2H_bit.CCR210
#define TIM1_CCR2H_CCR211        TIM1_CCR2H_bit.CCR211
#define TIM1_CCR2H_CCR212        TIM1_CCR2H_bit.CCR212
#define TIM1_CCR2H_CCR213        TIM1_CCR2H_bit.CCR213
#define TIM1_CCR2H_CCR214        TIM1_CCR2H_bit.CCR214
#define TIM1_CCR2H_CCR215        TIM1_CCR2H_bit.CCR215

#define TIM1_CCR2L_CCR20         TIM1_CCR2L_bit.CCR20
#define TIM1_CCR2L_CCR21         TIM1_CCR2L_bit.CCR21
#define TIM1_CCR2L_CCR22         TIM1_CCR2L_bit.CCR22
#define TIM1_CCR2L_CCR23         TIM1_CCR2L_bit.CCR23
#define TIM1_CCR2L_CCR24         TIM1_CCR2L_bit.CCR24
#define TIM1_CCR2L_CCR25         TIM1_CCR2L_bit.CCR25
#define TIM1_CCR2L_CCR26         TIM1_CCR2L_bit.CCR26
#define TIM1_CCR2L_CCR27         TIM1_CCR2L_bit.CCR27

#define TIM1_CCR3H_CCR38         TIM1_CCR3H_bit.CCR38
#define TIM1_CCR3H_CCR39         TIM1_CCR3H_bit.CCR39
#define TIM1_CCR3H_CCR310        TIM1_CCR3H_bit.CCR310
#define TIM1_CCR3H_CCR311        TIM1_CCR3H_bit.CCR311
#define TIM1_CCR3H_CCR312        TIM1_CCR3H_bit.CCR312
#define TIM1_CCR3H_CCR313        TIM1_CCR3H_bit.CCR313
#define TIM1_CCR3H_CCR314        TIM1_CCR3H_bit.CCR314
#define TIM1_CCR3H_CCR315        TIM1_CCR3H_bit.CCR315

#define TIM1_CCR3L_CCR30         TIM1_CCR3L_bit.CCR30
#define TIM1_CCR3L_CCR31         TIM1_CCR3L_bit.CCR31
#define TIM1_CCR3L_CCR32         TIM1_CCR3L_bit.CCR32
#define TIM1_CCR3L_CCR33         TIM1_CCR3L_bit.CCR33
#define TIM1_CCR3L_CCR34         TIM1_CCR3L_bit.CCR34
#define TIM1_CCR3L_CCR35         TIM1_CCR3L_bit.CCR35
#define TIM1_CCR3L_CCR36         TIM1_CCR3L_bit.CCR36
#define TIM1_CCR3L_CCR37         TIM1_CCR3L_bit.CCR37

#define TIM1_CCR4H_CCR48         TIM1_CCR4H_bit.CCR48
#define TIM1_CCR4H_CCR49         TIM1_CCR4H_bit.CCR49
#define TIM1_CCR4H_CCR410        TIM1_CCR4H_bit.CCR410
#define TIM1_CCR4H_CCR411        TIM1_CCR4H_bit.CCR411
#define TIM1_CCR4H_CCR412        TIM1_CCR4H_bit.CCR412
#define TIM1_CCR4H_CCR413        TIM1_CCR4H_bit.CCR413
#define TIM1_CCR4H_CCR414        TIM1_CCR4H_bit.CCR414
#define TIM1_CCR4H_CCR415        TIM1_CCR4H_bit.CCR415

#define TIM1_CCR4L_CCR40         TIM1_CCR4L_bit.CCR40
#define TIM1_CCR4L_CCR41         TIM1_CCR4L_bit.CCR41
#define TIM1_CCR4L_CCR42         TIM1_CCR4L_bit.CCR42
#define TIM1_CCR4L_CCR43         TIM1_CCR4L_bit.CCR43
#define TIM1_CCR4L_CCR44         TIM1_CCR4L_bit.CCR44
#define TIM1_CCR4L_CCR45         TIM1_CCR4L_bit.CCR45
#define TIM1_CCR4L_CCR46         TIM1_CCR4L_bit.CCR46
#define TIM1_CCR4L_CCR47         TIM1_CCR4L_bit.CCR47

#define TIM1_BKR_LOCK            TIM1_BKR_bit.LOCK
#define TIM1_BKR_OSSI            TIM1_BKR_bit.OSSI
#define TIM1_BKR_OSSR            TIM1_BKR_bit.OSSR
#define TIM1_BKR_BKE             TIM1_BKR_bit.BKE
#define TIM1_BKR_BKP             TIM1_BKR_bit.BKP
#define TIM1_BKR_AOE             TIM1_BKR_bit.AOE
#define TIM1_BKR_MOE             TIM1_BKR_bit.MOE

