echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l151k4.h
/* ADC1 low threshold register high */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LT8         : 1;
  unsigned char LT9         : 1;
  unsigned char LT10        : 1;
  unsigned char LT11        : 1;
} __BITS_ADC1_LTRH;
#endif
__IO_REG8_BIT(ADC1_LTRH,   0x5348, __READ_WRITE, __BITS_ADC1_LTRH);

/* ADC1 low threshold register low */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char LT0         : 1;
  unsigned char LT1         : 1;
  unsigned char LT2         : 1;
  unsigned char LT3         : 1;
  unsigned char LT4         : 1;
  unsigned char LT5         : 1;
  unsigned char LT6         : 1;
  unsigned char LT7         : 1;
} __BITS_ADC1_LTRL;
#endif
__IO_REG8_BIT(ADC1_LTRL,   0x5349, __READ_WRITE, __BITS_ADC1_LTRL);

/* ADC1 channel sequence 1 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CHSEL_S24   : 1;
  unsigned char CHSEL_S25   : 1;
  unsigned char CHSEL_S26   : 1;
  unsigned char CHSEL_S27   : 1;
  unsigned char CHSEL_S28   : 1;
  unsigned char CHSEL_S29   : 1;
  unsigned char             : 1;
  unsigned char DMAOFF      : 1;
} __BITS_ADC1_SQR1;
#endif
__IO_REG8_BIT(ADC1_SQR1,   0x534A, __READ_WRITE, __BITS_ADC1_SQR1);

/* ADC1 channel sequence 2 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CHSEL_S16   : 1;
  unsigned char CHSEL_S17   : 1;
  unsigned char CHSEL_S18   : 1;
  unsigned char CHSEL_S19   : 1;
  unsigned char CHSEL_S20   : 1;
  unsigned char CHSEL_S21   : 1;
  unsigned char CHSEL_S22   : 1;
  unsigned char CHSEL_S23   : 1;
} __BITS_ADC1_SQR2;
#endif
__IO_REG8_BIT(ADC1_SQR2,   0x534B, __READ_WRITE, __BITS_ADC1_SQR2);

/* ADC1 channel sequence 3 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CHSEL_S8    : 1;
  unsigned char CHSEL_S9    : 1;
  unsigned char CHSEL_S10   : 1;
  unsigned char CHSEL_S11   : 1;
  unsigned char CHSEL_S12   : 1;
  unsigned char CHSEL_S13   : 1;
  unsigned char CHSEL_S14   : 1;
  unsigned char CHSEL_S15   : 1;
} __BITS_ADC1_SQR3;
#endif
__IO_REG8_BIT(ADC1_SQR3,   0x534C, __READ_WRITE, __BITS_ADC1_SQR3);

/* ADC1 channel sequence 4 register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CHSEL_S0    : 1;
  unsigned char CHSEL_S1    : 1;
  unsigned char CHSEL_S2    : 1;
  unsigned char CHSEL_S3    : 1;
  unsigned char CHSEL_S4    : 1;
  unsigned char CHSEL_S5    : 1;
  unsigned char CHSEL_S6    : 1;
  unsigned char CHSEL_S7    : 1;
} __BITS_ADC1_SQR4;
#endif
__IO_REG8_BIT(ADC1_SQR4,   0x534D, __READ_WRITE, __BITS_ADC1_SQR4);

/* ADC1 trigger disable 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TRIG24      : 1;
  unsigned char TRIG25      : 1;
  unsigned char TRIG26      : 1;
  unsigned char TRIG27      : 1;
  unsigned char VREFINTON   : 1;
  unsigned char TSON        : 1;
} __BITS_ADC1_TRIGR1;
#endif
__IO_REG8_BIT(ADC1_TRIGR1, 0x534E, __READ_WRITE, __BITS_ADC1_TRIGR1);

/* ADC1 trigger disable 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TRIG16      : 1;
  unsigned char TRIG17      : 1;
  unsigned char TRIG18      : 1;
  unsigned char TRIG19      : 1;
  unsigned char TRIG20      : 1;
  unsigned char TRIG21      : 1;
  unsigned char TRIG22      : 1;
  unsigned char TRIG23      : 1;
} __BITS_ADC1_TRIGR2;
#endif
__IO_REG8_BIT(ADC1_TRIGR2, 0x534F, __READ_WRITE, __BITS_ADC1_TRIGR2);

/* ADC1 trigger disable 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TRIG8       : 1;
  unsigned char TRIG9       : 1;
  unsigned char TRIG10      : 1;
  unsigned char TRIG11      : 1;
  unsigned char TRIG12      : 1;
  unsigned char TRIG13      : 1;
  unsigned char TRIG14      : 1;
  unsigned char TRIG15      : 1;
} __BITS_ADC1_TRIGR3;
#endif
__IO_REG8_BIT(ADC1_TRIGR3, 0x5350, __READ_WRITE, __BITS_ADC1_TRIGR3);

/* ADC1 trigger disable 4 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char TRIG0       : 1;
  unsigned char TRIG1       : 1;
  unsigned char TRIG2       : 1;
  unsigned char TRIG3       : 1;
  unsigned char TRIG4       : 1;
  unsigned char TRIG5       : 1;
  unsigned char TRIG6       : 1;
  unsigned char TRIG7       : 1;
} __BITS_ADC1_TRIGR4;
#endif
__IO_REG8_BIT(ADC1_TRIGR4, 0x5351, __READ_WRITE, __BITS_ADC1_TRIGR4);


/*-------------------------------------------------------------------------
 *      ADC1 bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define ADC1_CR1_ADON            ADC1_CR1_bit.ADON
#define ADC1_CR1_START           ADC1_CR1_bit.START
#define ADC1_CR1_CONT            ADC1_CR1_bit.CONT
#define ADC1_CR1_EOCIE           ADC1_CR1_bit.EOCIE
#define ADC1_CR1_AWDIE           ADC1_CR1_bit.AWDIE
#define ADC1_CR1_RES             ADC1_CR1_bit.RES
#define ADC1_CR1_OVERIE          ADC1_CR1_bit.OVERIE

#define ADC1_CR2_SMTP1           ADC1_CR2_bit.SMTP1
#define ADC1_CR2_EXTSEL0         ADC1_CR2_bit.EXTSEL0
#define ADC1_CR2_EXTSEL1         ADC1_CR2_bit.EXTSEL1
#define ADC1_CR2_TRIG_EDGE0      ADC1_CR2_bit.TRIG_EDGE0
#define ADC1_CR2_TRIG_EDGE1      ADC1_CR2_bit.TRIG_EDGE1
#define ADC1_CR2_PRESC           ADC1_CR2_bit.PRESC

#define ADC1_CR3_CHSEL           ADC1_CR3_bit.CHSEL
#define ADC1_CR3_SMTP2           ADC1_CR3_bit.SMTP2

#define ADC1_SR_EOC              ADC1_SR_bit.EOC
#define ADC1_SR_AWD              ADC1_SR_bit.AWD
#define ADC1_SR_OVER             ADC1_SR_bit.OVER

#define ADC1_DRH_CONV_DATA8      ADC1_DRH_bit.CONV_DATA8
#define ADC1_DRH_CONV_DATA9      ADC1_DRH_bit.CONV_DATA9
#define ADC1_DRH_CONV_DATA10     ADC1_DRH_bit.CONV_DATA10
#define ADC1_DRH_CONV_DATA11     ADC1_DRH_bit.CONV_DATA11

#define ADC1_DRL_CONV_DATA0      ADC1_DRL_bit.CONV_DATA0
#define ADC1_DRL_CONV_DATA1      ADC1_DRL_bit.CONV_DATA1
#define ADC1_DRL_CONV_DATA2      ADC1_DRL_bit.CONV_DATA2
#define ADC1_DRL_CONV_DATA3      ADC1_DRL_bit.CONV_DATA3
#define ADC1_DRL_CONV_DATA4      ADC1_DRL_bit.CONV_DATA4
#define ADC1_DRL_CONV_DATA5      ADC1_DRL_bit.CONV_DATA5
#define ADC1_DRL_CONV_DATA6      ADC1_DRL_bit.CONV_DATA6
#define ADC1_DRL_CONV_DATA7      ADC1_DRL_bit.CONV_DATA7

