echolin2020/stm8l-lora/STM8L15x_StdPeriph_Driver/inc/iostm8l151k4.h
#define MASK_DAC_DORH_DORH       0x0F


/*-------------------------------------------------------------------------
 *      RI register definitions
 *-----------------------------------------------------------------------*/
/* Timer input capture routing register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IC2CS       : 5;
} __BITS_RI_ICR1;
#endif
__IO_REG8_BIT(RI_ICR1,     0x5431, __READ_WRITE, __BITS_RI_ICR1);

/* Timer input capture routing register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IC3CS       : 5;
} __BITS_RI_ICR2;
#endif
__IO_REG8_BIT(RI_ICR2,     0x5432, __READ_WRITE, __BITS_RI_ICR2);

/* I/O input register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH1I        : 1;
  unsigned char CH4I        : 1;
  unsigned char CH7I        : 1;
  unsigned char CH10I       : 1;
  unsigned char CH13I       : 1;
  unsigned char CH16I       : 1;
  unsigned char CH19I       : 1;
  unsigned char CH22I       : 1;
} __BITS_RI_IOIR1;
#endif
__IO_REG8_BIT(RI_IOIR1,    0x5433, __READ, __BITS_RI_IOIR1);

/* I/O input register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH2I        : 1;
  unsigned char CH5I        : 1;
  unsigned char CH8I        : 1;
  unsigned char CH11I       : 1;
  unsigned char CH14I       : 1;
  unsigned char CH17I       : 1;
  unsigned char CH20I       : 1;
  unsigned char CH23I       : 1;
} __BITS_RI_IOIR2;
#endif
__IO_REG8_BIT(RI_IOIR2,    0x5434, __READ, __BITS_RI_IOIR2);

/* I/O input register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH3I        : 1;
  unsigned char CH6I        : 1;
  unsigned char CH9I        : 1;
  unsigned char CH12I       : 1;
  unsigned char CH15I       : 1;
  unsigned char CH18I       : 1;
  unsigned char CH21I       : 1;
  unsigned char CH24I       : 1;
} __BITS_RI_IOIR3;
#endif
__IO_REG8_BIT(RI_IOIR3,    0x5435, __READ, __BITS_RI_IOIR3);

/* I/O control mode register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH1M        : 1;
  unsigned char CH4M        : 1;
  unsigned char CH7M        : 1;
  unsigned char CH10M       : 1;
  unsigned char CH13M       : 1;
  unsigned char CH16M       : 1;
  unsigned char CH19M       : 1;
  unsigned char CH22M       : 1;
} __BITS_RI_IOCMR1;
#endif
__IO_REG8_BIT(RI_IOCMR1,   0x5436, __READ_WRITE, __BITS_RI_IOCMR1);

/* I/O control mode register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH2M        : 1;
  unsigned char CH5M        : 1;
  unsigned char CH8M        : 1;
  unsigned char CH11M       : 1;
  unsigned char CH14M       : 1;
  unsigned char CH17M       : 1;
  unsigned char CH20M       : 1;
  unsigned char CH23M       : 1;
} __BITS_RI_IOCMR2;
#endif
__IO_REG8_BIT(RI_IOCMR2,   0x5437, __READ_WRITE, __BITS_RI_IOCMR2);

/* I/O control mode register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH3M        : 1;
  unsigned char CH6M        : 1;
  unsigned char CH9M        : 1;
  unsigned char CH12M       : 1;
  unsigned char CH53M       : 1;
  unsigned char CH18M       : 1;
  unsigned char CH21M       : 1;
  unsigned char CH24M       : 1;
} __BITS_RI_IOCMR3;
#endif
__IO_REG8_BIT(RI_IOCMR3,   0x5438, __READ_WRITE, __BITS_RI_IOCMR3);

/* I/O switch register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH1E        : 1;
  unsigned char CH4E        : 1;
  unsigned char CH7E        : 1;
  unsigned char CH10E       : 1;
  unsigned char CH13E       : 1;
  unsigned char CH16E       : 1;
  unsigned char CH19E       : 1;
  unsigned char CH22E       : 1;
} __BITS_RI_IOSR1;
#endif
__IO_REG8_BIT(RI_IOSR1,    0x5439, __READ_WRITE, __BITS_RI_IOSR1);

/* I/O switch register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH2E        : 1;
  unsigned char CH5E        : 1;
  unsigned char CH8E        : 1;
  unsigned char CH11E       : 1;
  unsigned char CH14E       : 1;
  unsigned char CH17E       : 1;
  unsigned char CH20E       : 1;
  unsigned char CH23E       : 1;
} __BITS_RI_IOSR2;
#endif
__IO_REG8_BIT(RI_IOSR2,    0x543A, __READ_WRITE, __BITS_RI_IOSR2);

/* I/O switch register 3 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char CH3E        : 1;
  unsigned char CH6E        : 1;
  unsigned char CH9E        : 1;
  unsigned char CH12E       : 1;
  unsigned char CH15E       : 1;
  unsigned char CH18E       : 1;
  unsigned char CH21E       : 1;
  unsigned char CH24E       : 1;
} __BITS_RI_IOSR3;
#endif
__IO_REG8_BIT(RI_IOSR3,    0x543B, __READ_WRITE, __BITS_RI_IOSR3);

/* I/O group control register */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char IOM1        : 2;
  unsigned char IOM2        : 2;
  unsigned char IOM3        : 2;
} __BITS_RI_IOGCR;
#endif
__IO_REG8_BIT(RI_IOGCR,    0x543C, __READ_WRITE, __BITS_RI_IOGCR);

/* Analog switch register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char AS0         : 1;
  unsigned char AS1         : 1;
  unsigned char AS2         : 1;
  unsigned char AS3         : 1;
  unsigned char AS4         : 1;
  unsigned char AS5         : 1;
  unsigned char AS6         : 1;
  unsigned char AS7         : 1;
} __BITS_RI_ASCR1;
#endif
__IO_REG8_BIT(RI_ASCR1,    0x543D, __READ_WRITE, __BITS_RI_ASCR1);

/* Analog switch register 2 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char AS8         : 1;
  unsigned char             : 5;
  unsigned char AS14        : 1;
} __BITS_RI_ASCR2;
#endif
__IO_REG8_BIT(RI_ASCR2,    0x543E, __READ_WRITE, __BITS_RI_ASCR2);

/* Resistor control register 1 */
#ifdef __IAR_SYSTEMS_ICC__
typedef struct
{
  unsigned char KPU10       : 1;
  unsigned char KPU400      : 1;
  unsigned char KPD10       : 1;
  unsigned char KPD400      : 1;
} __BITS_RI_RCR;
#endif
__IO_REG8_BIT(RI_RCR,      0x543F, __READ_WRITE, __BITS_RI_RCR);


/*-------------------------------------------------------------------------
 *      RI bit fields
 *-----------------------------------------------------------------------*/
#ifdef __IAR_SYSTEMS_ICC__

#define RI_ICR1_IC2CS            RI_ICR1_bit.IC2CS

#define RI_ICR2_IC3CS            RI_ICR2_bit.IC3CS

